{
  "title": "Helping Others Through Crafting and Sewing",
  "path": "/blog/helping-others-through-crafting-and-sewing",
  "date": "04/21/2020",
  "featuredImage": {
    "image": null
  },
  "blocks": [
    {
      "content": "A hearteffect of the coronavirus is that it has shown the true compassion and desire to help others that is part of the human spirit.  There is such good in the world and it can be seen through all the healthcare and emergency workers, the store clerks and the many others who are keeping the world running while many of us are in quarantine.\n\nYou may have seen all the information about homemade face masks being sewn to help protect healthcare workers since there is a shortage of masks.  It is amazing to hear stories of individuals making and donating masks to hospitals, nursing homes and any place they may be needed.  Just yesterday a woman in our church sent out emails to church members offering to make masks for anyone or any organization who may need them.  She has dozens of requests pouring in and no doubt is busily happily sewing and helping others.\n\nI hope that the spirit of crafting to help others will continue even after the Coronavirus situation is over..  If you want to help others through your crafting, but aren’t sure where to start, keep reading for some ideas to get you started.\n\nDo you love to create but find yourself wanting to do more?\n\nPerhaps you’ve given lots of thoughtful homemade gifts to family and friends or sold your creations at craft fairs but you still find yourself wanting to make more of a difference.\n\nStart by deciding if you’d like to donate locally in your area or on a more national/international level.  You can search online by googling ‘crafting for charity’\n\nBelow is a list of some ideas to help you begin creating and making a difference today.\n\n(Contact your local agencies to see what items they can use)\n\n## KNITTING/CROCHETING\n\nTaking some yarn and a ‘stick’ or two’ and being able to create hats, scarves, blankets or stuffed animals and so much more is a fantastic feeling.  And what could make that feeling even better is sharing that creation with others.\n\nDon’t worry If you’ve never knitted/crocheted before, that’s ok because there’s plenty of places online to learn how, just google ‘how to knit/crochet’.  You’ll also find plenty of patterns online for projects for beginners to experts.\n\n**Ideas of what to donate where:**\n\n* Newborn Hats to preemies at hospitals.\n* [Loom Knit Hats](https://www.youtube.com/watch?v=7qNMahX0WvU) and [No Sew Fleece Scarves](https://www.youtube.com/watch?v=GLOKgAHZZOU) to a homeless shelter.\n* Blankets to an animal shelter.\n* Stuffed animals to a hospital or shelter\n\n[AllFreeKnitting](http://allfreeknitting.com/) is a List of Some National and International Charities that accept knitted items, as well as patterns for some projects.\n\n## Sewing\n\nIf you love to create by sewing,or have always wanted to try, then get out that sewing machine or needle and thread and you can whip up some fantastic items.\n\n**What Can You Make:**\n\n* Pillowcases for a childrens hospital\n* Stuffed animals for local police to hand out to children in difficult situations.  (My teenagers still have their hand sewn teddy bears they got when we were in a car accident when they were four)\n* Tote Bags for a childrens club.\n* Dresses for Operation Christmas Child Shoeboxes\n* Quilts to donate to organizations for an auction\n\n[SewNews](http://www.sewnews.com/) has a great list of charities that accept different sewn items.\n\n## Painting, Clayware and Woodworking\n\nIf you enjoy creating and have a special skill such as painting, woodworking, soap making, making pottery you can donate your beautiful items to a charity having an auction, or fill a specific need for a certain group.\n\n**For Example:**\n\nIf you paint perhaps you could paint/draw a small picture of a dog and cat then make prints on cardstock that an animal rescue could sell, or use for thank you notes.\n\nAs a woodworker you could create small wood cars and trucks to donate to a women's shelter, to a children’s hospital or to put in Operation Christmas Child Shoeboxes.\n\nMaybe you have an organization in mind, but aren’t sure what you could make to help them.  The following is a list of a few things that you can create.\n\n### To a daycare or children’s hospital\n\n* Upcycled crayons\n* [T-shirt Jump Ropes](https://www.youtube.com/watch?v=lF-qEfxEveg)\n* Simple felt puppets\n* Ribbon dancers\n* Wooden cars\n* [Washer necklaces](https://www.youtube.com/watch?v=qsFS80OzvXA)\n\n### For an animal shelter\n\n* Homemade dog or cat toys\n* Blankets\n* Simple stuffed animals\n\n### For your local library\n\n* Cute bookmarks to give out to new members or children\n* Tote bags for them to sell.\n* Hand drawn/painted note cards to sell",
      "center": false,
      "_template": "ContentBlock"
    }
  ],
  "draft": false,
  "categories": [
    "Charity",
    "Projects"
  ],
  "sidebar": {
    "showSidebar": false,
    "sidebarSections": [
      {
        "_template": "SidebarBlock",
        "sectionTitle": "Welcome!",
        "sidebarBlocks": [
          {
            "image": "",
            "_template": "ImageBlock",
            "maxWidth": 700,
            "rounded": false
          }
        ]
      }
    ]
  }
}